{
  "header": {
    "whatIAm": "Web developer · Musician · Nature lover"
  },
  "skills": {
    "section-title": "Skills",
    "level-1": "novice",
    "level-2": "basic knowledge",
    "level-3": "confirmed knowledge",
    "level-4": "advanced knowledge",
    "categories": {
      "Back-end": "Back-end",
      "Front-end": "Front-end",
      "Test / CI": "Test / CI",
      "DBMS": "DBMS",
      "Misc": "Misc"
    }
  },
  "projects": {
    "built-with:": "Built with:",
    "more-info": "learn more",
    "section-title": "Projects",
    "suivie": {
      "title": "SuiVie",
      "description": "SuiVie is a web application inspired by the Bullet Journal's trackers tool. It aims to track your habits like sports, food, hygiene, self-care, expenses... Even if it works on desktop, it is designed for mobile devices. I work alone on this project.",
      "details": {
        "part1": "SuiVie is a web application inspired by the habit tracking tool of a bullet journal. It aims to track your habits such as sports, food, hygiene, personal care, expenses...",
        "part2": "The website is developed mainly for mobile (a desktop version will be released soon).",
        "part3": "This project was created for two reasons:",
        "reason1": "I was looking to develop an application in React using some tools I wanted to learn (TypeScript, Cypress, Recharts in particular).",
        "reason2": "I like statistics and I used to organise my life around 2 productivity tools: todo lists and the calendar. Thanks to them, I could efficiently organise and plan my one-off events. To complement them, I wanted a tool that would give me an overview of my habits",
        "feat1": "Create a tracker with a name, start date, colour, duration, frequency and goals",
        "feat2": "Validate a tracker (partially or completely) today or in the past",
        "feat3": "Hide a tracker for a day if you are sure you won't validate it or if you want to concentrate on other trackers",
        "feat4": "View tracker statistics by week, month and year",
        "feat5": "Archive, delete or edit your trackers at any time",
        "feat6": "Dark or light theme available",
        "tech1": "The application uses <b>React, TypeScript, MUI, Framer, Redux and Recharts</b>. It is tested using <b>Jest</b> for unit testing (100% coverage on reducers) and <b>Cypress</b> for functional testing. The code is formatted using <b>Prettier</b> and follows <b>ESLint</b> recommendations.",
        "tech2": "The development of the application takes advantage of the numerous tools available on <b>GitHub</b>. A <b>Kanban</b> board defines the features to be developed in order of priority, issues are created and then resolved within pull requests. Finally, a <b>CI/CD pipeline</b> automatically tests and deploys the code via a <b>GitHub Action</b>."
      },
      "images": {
        "home": "Home page",
        "trackers": "Tracker list",
        "custom-validate": "Partial validation",
        "create": "Tracker creation",
        "dark-mode": "Dark theme",
        "manage": "Tracker management",
        "stats": "Statistics",
        "settings": "Settings"
      }
    },
    "grottocenter": {
      "title": "Grottocenter",
      "description": "Grottocenter is a community world database dedicated to speleology and based on the wiki collaborative system. Since 2019, as a freelancer, I have worked on various features (authentication, notifications, advanced search, document submission) & I have been involved in the architecture choices, code maintenance and many refactorings.",
      "details": {
        "part1": "GrottoCenter is a community database dedicated to speleology and fed by speleologists on the principle of Wiki, that is to say that the content of the site can be modified by all registered users. The website is managed and developed by the Wikicaves association.",
        "part2": "Wikicaves has asked me to develop many features since 2019 on both the client and server sides.",
        "auth": "Registration and login forms development as well as the password reset functionality (token sent by email via the AWS SES service).",
        "test-setup": "Setting up tests on the API and the automatic test pipeline via GitHub Action. Writing of the tests to get to about 50% coverage (constantly increasing since).",
        "notifications": "Subscription system for a massif or a country to receive notifications when an entity (cavity, organisation, document) is created, modified or deleted on it. Sending mail and displaying notifications in the web client.",
        "advanced-search": "Advanced search on multiple entities (cavities, organisations, clumps and documents) using Elasticsearch.",
        "user-management": "Interface for administrators to appoint or dismiss other administrators, moderators or leaders.",
        "client-tech": "On the client side, I used <b>React</b> (with Redux and Contexts) and <b>MUI</b>.",
        "server-tech": "On the server side, Sails.js is used as the REST API, testing is done by Mocha, documentation is generated by Swagger and the (geographic) database is based on PostgreSQL."
      },
      "images": {
        "home": "Home page",
        "auth": "Authentication form",
        "code-coverage": "57% of code coverage (in October 2022)",
        "notifications": "Overview of notifications",
        "advanced-search": "Cavity entrance search form",
        "user-management": "Adding an administrator"
      }
    },
    "mizk": {
      "title": "Mizk",
      "description": "Mizk is a web application providing various multimedia and useful tools such as calculators, image processors or encoders / decoders.",
      "details": {
        "part1": "Mizk is a project that aims to bring together on a single site various simple tools for file manipulation, conversions, image editing, etc.",
        "part2": "The tools offered are intended to be <b>simple</b>, <b>fast</b> and <b>easy to use</b>. On other sites of the same kind, it is often necessary to press a button to calculate the result of an operation. On Mizk, calculations are carried out in real time, at the pace of the user's input. Copy buttons for the results are also present to retrieve the value of a conversion or calculation.",
        "tech1": "The application uses <b>React</b> (+ <b>Typescript</b>) with <b>Chakra UI</b>. The code is formatted using <b>Prettier</b> and follows <b>ESLint</b> recommendations.",
        "tech2": "The development of the application takes advantage of the numerous tools available on <b>GitHub</b>. Issues are created and then resolved via pull requests. Finally, a <b>CI/CD pipeline</b> automatically tests and deploys the code via a <b>GitHub Action</b>.",
        "feat1": "Duration calculator",
        "feat2": "Base64 encoder / decoder",
        "feat3": "Color converter",
        "feat4": "Image converter",
        "feat5": "Image cropper",
        "feat6": "String replacer",
        "feat7": "Temperature converter",
        "feat8": "Word counter",
        "feat9": "Tool search bar"
      },
      "images": {
        "menu": "Left side menu",
        "colors": "Color converter",
        "image-crop": "Image cropper",
        "string-replacer": "String replacer"
      }
    }
  },
  "about": {
    "section-title": "About me",
    "greeting": "Hi, I'm {name}!",
    "part1": "I'm a human being and also a web developer. I like to build <b>user-friendly and beautiful web interfaces but also useful and practical REST API for other developers</b>. I have graduated in <b>computer science engineering</b> in 2019. I am constantly learning and improving my self to enhance my code quality: refactoring, reducing repetitions, testing and documenting my code is a <u>core part of my workflow</u>.",
    "part2": "I am thriving by developing solution for meaningful organizations, which work on fields like <b>education, health, protection of the environment, climate change fighting or knowledge sharing</b>.",
    "part3": "When I'm not pixel-perfecting a web interface or pushing an API refactoring on GitHub, I'm making music at the {onyxStudioLink}. You will also find me hiking in the Ariège Pyrenees (South of France), picking mushrooms or chestnuts.",
    "timeline": {
      "dut": "CS D.U.T",
      "engineer-degree": "CS Engineer Degree",
      "freelance": "Freelance Developer"
    }
  },
  "contact": {
    "download-cv": "Download my resume",
    "section-title": "Contact me",
    "text": "I'm currently looking for a job or a mission (less than 6 months) 😀"
  },
  "advanced-search": "advanced search",
  "authentication": "authentication",
  "back-to-projects": "Back to the project list",
  "built-using": "Website built using {vueLink}, {sassLink} and {vueI18nLink}",
  "change-language:": "Change language:",
  "notifications": "notifications",
  "features": "features",
  "presentation": "presentation",
  "technical-overview": "technical overview",
  "test-setup": "test setup",
  "user-management": "users management",
  "vue-framework": "the Vue.js framework"
}
