{
  "header": {
    "whatIAm": "Développeur web · Musicien · Amoureux de la nature"
  },
  "skills": {
    "section-title": "Compétences",
    "level-1": "novice",
    "level-2": "connaissances basiques",
    "level-3": "connaissances confirmées",
    "level-4": "connaissances poussées"
  },
  "Back-end": "Back-end",
  "Front-end": "Front-end",
  "Test / CI": "Test / CI",
  "DBMS": "SGBD",
  "Misc": "Divers",
  "change-language:": "Changer de langue :",
  "back-to-projects": "Revenir à la liste des projets",
  "features": "fonctionnalités",
  "presentation": "présentation",
  "technical-overview": "description technique",
  "under-construction": "En construction : revenez ultérieurement !",
  "projects": {
    "built-with:": "Développé avec :",
    "more-info": "en savoir +",
    "section-title": "Projets",
    "suivie": {
      "title": "SuiVie",
      "description": "SuiVie est une application web inspirée de l'outil de suivi d'habitudes d'un bullet journal. Elle a pour but de suivre vos habitudes comme le sport, la nourriture, l'hygiène, les soins personnels, les dépenses... Même si elle fonctionne sur ordinateur, elle est conçue pour les appareils mobiles. Je travaille seul sur ce projet.",
      "details": {
        "part1": "SuiVie est une application web inspirée de l'outil de suivi d'habitudes d'un bullet journal. Elle a pour but de suivre vos habitudes comme le sport, la nourriture, l'hygiène, les soins personnels, les dépenses...",
        "part2": "Il s'agit d'un site web développé principalement pour mobile (une version desktop verra bientôt le jour).",
        "part3": "Ce projet a vu le jour pour deux raisons :",
        "reason1": "je cherchais à développer une application en React en utilisant certains outils que je souhaitais apprendre (TypeScript, Cypress, Recharts notamment).",
        "reason2": "j'aime les statistiques et j'organisais ma vie autour de 2 outils de productivité : les todo lists et le calendrier. Grâce à eux, je peux efficacement organiser et planifier mes évènements ponctuels. Pour les compléter, je souhaitais donc bénéficier d'un outil me permettant d'avoir une vue d'ensemble de mes habitudes.",
        "feat1": "Créer un tracker avec un nom, une date de début, une couleur, une durée, une fréquence et des objectifs",
        "feat2": "Valider un tracker (partiellement ou complètement) aujourd'hui ou dans le passé",
        "feat3": "Masquer un tracker pour un jour si vous êtes sûr de ne pas le valider ou si vous voulez vous concentrer sur les autres trackers",
        "feat4": "Visualiser des statistiques sur les trackers par semaine, mois et année",
        "feat5": "Archiver, supprimer ou éditer vos trackers à tout moment",
        "feat6": "Thème sombre ou clair disponibles",
        "tech1": "L'application utilise <b>React, TypeScript, MUI, Framer, Redux et Recharts</b>. Elle est testée à l'aide de <b>Jest</b> pour les tests unitaires (100% de couverture sur les reducers) et <b>Cypress</b> pour les tests fonctionnels. L'ensemble du code est formatté grâce à <b>Prettier</b> et suit les recommendations d'<b>ESLint</b>.",
        "tech2": "Le développement de l'application exploite les nombreux outils disponibles sur <b>GitHub</b>. Un tableau <b>Kanban</b> définit les fonctionnalités à développer par ordre de priorité, des issues sont créées puis résolues au sein des pull requests. Enfin, un <b>pipeline CI/CD</b> teste et déploie automatiquement le code via une <b>GitHub Action</b>."
      },
      "images": {
        "home": "Page d'accueil",
        "trackers": "Liste des trackers",
        "custom-validate": "Validation partielle",
        "create": "Création d'un tracker",
        "dark-mode": "Thème sombre",
        "manage": "Gestion des trackers",
        "stats": "Statistiques",
        "settings": "Paramètres"
      }
    },
    "grottocenter": {
      "title": "Grottocenter",
      "description": "Grottocenter est une base de données mondiale communautaire dédiée à la spéléologie et basée sur le système collaboratif wiki. Depuis 2019, en tant que freelance, j'ai travaillé sur différentes fonctionnalités (authentification, notifications, recherche avancée, soumission de documents) et j'ai contribué aux choix d'architecture, à la maintenance du code et ainsi qu'à de nombreux refactorings."
    }
  },
  "about": {
    "section-title": "À propos de moi",
    "greeting": "Bien le bonjour, je m'appelle <b>Clément Roig</b> !",
    "part1": "Je suis un être humain et aussi un développeur web. J'aime concevoir des <b>interfaces web agréables et esthétiques, mais aussi des API REST utiles et pratiques pour les autres développeurs</b>. J'ai obtenu mon <b>diplôme d'ingénieur en informatique et gestion</b> en 2019. Je suis constamment en train d'apprendre et de m'améliorer pour parfaire le code que je produis : le refactoring, la réduction des répétitions, les tests et la documentation forment une <u>partie essentielle de mon workflow</u>.",
    "part2": "Je m'épanouis en développant des solutions pour des organisations pertinentes selon moi, qui œuvrent dans des domaines comme <b>l'éducation, la santé, la protection de l'environnement, la lutte contre le changement climatique ou le partage des connaissances</b>.",
    "part3": "Quand je ne suis pas en train de peaufiner une interface web au pixel près ou de pousser un refactoring d'API sur GitHub, je fais de la musique à l'<a href=\"https://onyx-studio.fr\" rel=\"noopener noreferrer\">Onyx Studio</a>. Vous me trouverez également en randonnées dans les Pyrénées ariégeoises, ou entrain de cueillir des champignons ou des châtaignes.",
    "timeline": {
      "dut": "D.U.T Informatique",
      "engineer-degree": "Ingénieur en Informatique",
      "freelance": "Développeur Freelance"
    }
  },
  "contact": {
    "download-cv": "Télécharger mon CV",
    "section-title": "Me contacter",
    "text": "Je cherche actuellement un emploi ou une mission à hauteur de 28h / semaine maximum :)"
  },
  "built-using": "Site développé en utilisant <a href=\"https://vuejs.org/\" target=\"_blank\" rel=\"noopener noreferrer\">le framework Vue.js</a>, <a href=\"https://sass-lang.com/\" target=\"_blank\" rel=\"noopener noreferrer\">SASS (SCSS)</a> et <a href=\"https://kazupon.github.io/vue-i18n/\" target=\"_blank\" rel=\"noopener noreferrer\">Vue I18n</a>"
}
